# Basic SQL Setup

In [1]:
%load_ext sql

In [2]:
import csv,sqlite3
con=sqlite3.connect("my_data2.db")
cur=con.cursor()

In [3]:
%sql sqlite:///my_data2.db

# SQL Queries can now be executed in python

#### Deprtment Table creation with Constraints

In [5]:
%%sql
CREATE TABLE IF NOT EXISTS Department 
    (DepartmentId INT PRIMARY KEY NOT NULL,
     DepartmentName VARCHAR(30) NOT NULL);

 * sqlite:///my_data2.db
Done.

[]

In [6]:
%%sql
SELECT * FROM Department

 * sqlite:///my_data2.db
Done.

[]

In [7]:
%%sql
INSERT INTO Department
VALUES (1,'Sales'),
       (2,'Purchase'),
       (3,'Engineering'),
       (4,'HR')

 * sqlite:///my_data2.db
4 rows affected.

[]

In [8]:
%%sql
SELECT * FROM Department

 * sqlite:///my_data2.db
Done.

[(1, 'Sales'), (2, 'Purchase'), (3, 'Engineering'), (4, 'HR')]

In [9]:
%%sql
INSERT INTO Department
VALUES(3,'Accounts')

 * sqlite:///my_data2.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Department.DepartmentId
[SQL: INSERT INTO Department
VALUES(3,'Accounts')]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [10]:
%%sql
SELECT * FROM Department

 * sqlite:///my_data2.db
Done.

[(1, 'Sales'), (2, 'Purchase'), (3, 'Engineering'), (4, 'HR')]

In [11]:
%%sql
INSERT INTO Department
VALUES(5,NULL)

 * sqlite:///my_data2.db
(sqlite3.IntegrityError) NOT NULL constraint failed: Department.DepartmentName
[SQL: INSERT INTO Department
VALUES(5,NULL)]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [13]:
%%sql
SELECT * FROM Department

 * sqlite:///my_data2.db
Done.

[(1, 'Sales'), (2, 'Purchase'), (3, 'Engineering'), (4, 'HR')]

#### Creating Employee Data table

* Employee ID
* FirstName
* LastName
* Email
* DepartmentID
* Salary
* Hiring Date

In [15]:
%%sql
CREATE TABLE employee
    (EmployeeId INT PRIMARY KEY NOT NULL,
     FirstName VARCHAR(50) NOT NULL,
     LastName VARCHAR(50) NOT NULL,
     Email VARCHAR(100) NOT NULL,
     DepartmentId int,
      Salary DECIMAL(10,2) CHECK(Salary>0),
     CONSTRAINT fk_DepartmentId
         FOREIGN KEY (DepartmentID)
         REFERENCES Department(DepartmentID));

 * sqlite:///my_data2.db
Done.

[]

In [16]:
%%sql
SELECT * FROM employee

 * sqlite:///my_data2.db
Done.

[]

~~~
%%sql  
INSERT INTO Employee
VALUES (1,'Utkarsh','Gaikwad','utkarsh.etlhive@gmail.com',3,25000),
       (2,'Sarthak','Sharma','test@test.com',1,20000),
       (3,'Sayali','More','example@gmail.com',2,30000),
       (4,'Raman','Verma','raman@gmail.com',4,40000);
~~~

In [17]:
%%sql
INSERT INTO EMPLOYEE
VALUES (1,"Aishwarya","Mandhare","Aish@gamil.com",4,90000),
       (2,'Sarthak','Sharma','test@test.com',1,20000),
       (3,'Sayali','More','example@gmail.com',2,30000),
        (4,'Raman','Verma','raman@gmail.com',4,40000);

 * sqlite:///my_data2.db
4 rows affected.

[]

In [18]:
%%sql
SELECT * FROM EMPLOYEE

 * sqlite:///my_data2.db
Done.

[(1, 'Aishwarya', 'Mandhare', 'Aish@gamil.com', 4, 90000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000)]

## Trying to insert Repeated EmployeeID

In [19]:
%%sql
INSERT INTO EMPLOYEE
VALUES (8,"Raj","Malhotra","Raj@gmail.com",5,89000)

 * sqlite:///my_data2.db
1 rows affected.

[]

In [20]:
%%sql
SELECT * FROM EMPLOYEE

 * sqlite:///my_data2.db
Done.

[(1, 'Aishwarya', 'Mandhare', 'Aish@gamil.com', 4, 90000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000),
 (8, 'Raj', 'Malhotra', 'Raj@gmail.com', 5, 89000)]

In [21]:
%%sql
INSERT INTO Employee
VALUES (5,Null,'Doe','johndoe@gmail.com',1,27000)

 * sqlite:///my_data2.db
(sqlite3.IntegrityError) NOT NULL constraint failed: employee.FirstName
[SQL: INSERT INTO Employee
VALUES (5,Null,'Doe','johndoe@gmail.com',1,27000)]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [22]:
%%sql
SELECT * FROM EMPLOYEE

 * sqlite:///my_data2.db
Done.

[(1, 'Aishwarya', 'Mandhare', 'Aish@gamil.com', 4, 90000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000),
 (8, 'Raj', 'Malhotra', 'Raj@gmail.com', 5, 89000)]

In [23]:
%%sql
INSERT INTO Employee
VALUES (5,'John',Null,'johndoe@gmail.com',1,27000)/

 * sqlite:///my_data2.db
(sqlite3.OperationalError) near "/": syntax error
[SQL: INSERT INTO Employee
VALUES (5,'John',Null,'johndoe@gmail.com',1,27000)/]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [24]:
%%sql
SELECT * FROM Employee

 * sqlite:///my_data2.db
Done.

[(1, 'Aishwarya', 'Mandhare', 'Aish@gamil.com', 4, 90000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000),
 (8, 'Raj', 'Malhotra', 'Raj@gmail.com', 5, 89000)]

In [25]:
%%sql
INSERT INTO Employee
VALUES (5,'John','Doe','test@test.com',1,27000)

 * sqlite:///my_data2.db
1 rows affected.

[]

In [26]:
%%sql
INSERT INTO Employee
VALUES (5,'John','Doe','johndoe@test.com',1,-27000)

 * sqlite:///my_data2.db
(sqlite3.IntegrityError) CHECK constraint failed: Salary>0
[SQL: INSERT INTO Employee
VALUES (5,'John','Doe','johndoe@test.com',1,-27000)]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [27]:
%%sql
SELECT * FROM Employee

 * sqlite:///my_data2.db
Done.

[(1, 'Aishwarya', 'Mandhare', 'Aish@gamil.com', 4, 90000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000),
 (8, 'Raj', 'Malhotra', 'Raj@gmail.com', 5, 89000),
 (5, 'John', 'Doe', 'test@test.com', 1, 27000)]

In [28]:
%%sql 
INSERT INTO Employee
VALUES (5,'John','Doe','johndoe@test.com',1,27000)

 * sqlite:///my_data2.db
(sqlite3.IntegrityError) UNIQUE constraint failed: employee.EmployeeId
[SQL: INSERT INTO Employee
VALUES (5,'John','Doe','johndoe@test.com',1,27000)]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [29]:
%%sql
SELECT * FROM Employee

 * sqlite:///my_data2.db
Done.

[(1, 'Aishwarya', 'Mandhare', 'Aish@gamil.com', 4, 90000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000),
 (8, 'Raj', 'Malhotra', 'Raj@gmail.com', 5, 89000),
 (5, 'John', 'Doe', 'test@test.com', 1, 27000)]

## Close the connection in END

In [30]:
con.close()